const characteristics = [
    {
        category: 'Раковины',
        options: [ 
            ['Материал', ['санкерамика']], 
            ['Отверстие под перелив', ['да', 'нет']], 
            ['Отверстие под смеситель', ['да', 'нет']], 
            ['Тип', ['накладная', 'встраиваемая сверху', 'встраиваемая снизу', 'подвесная', 'угловая', 'напольная', 'столешница']], 
            ['Форма', ['овальная', 'прямоугольная', 'нестандартная', 'круглая', 'квадратная', 'полукруглая']], 
            ['Ширина, мм', [null]], 
            ['Глубина, мм', [null]], 
            ['Высота, мм', [null]], 
            ['Цвет', ['белый', 'черный', 'дерево', 'серый', 'синий', 'персиковый', 'серебро', 'мрамор', 'фиолетовый', 'желтый', 'салатовый', 'золото', 'бронза']], 
            ['Производитель', ['Melana']],
            ['Комплектация', ['сифон, донный клапан']]
        ]
    }
]