import { Category } from '../../../src/interfaces/index';

const exchangeRates: number = 2.4336;

/*fetch('https://www.nbrb.by/api/exrates/rates/431')
      .then((res) => {
        if (!res.ok) {
          exchangeRates = 2.5;
        }
        return res;
      })
      .then((data) => data.json())
      .then((number) => {
        exchangeRates = number.Cur_OfficialRate
      })
      .catch(() => exchangeRates = 2.5);*/


const goods: Category[] = [
    {
        name: 'Раковины| встраиваемые сверху',
        photo: 'rakoviny_vstraivaemye_sverhu.jpg',
        link: 'rakoviny_vstraivaemye_sverhu',
        cards: [
            {
                id: 1,
                photo: ['mln-307', 'jpg', '3'],
                name: 'Встраиваемая сверху раковина mln-307',
                price: parseFloat((49.6 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['встраиваемая сверху']], ['Форма', ['овальная']], ['Ширина, мм', ['520']], ['Глубина, мм', ['460']], ['Высота, мм', ['200']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-307',
                preLink: 'rakoviny_vstraivaemye_sverhu',
                same: ['mln-308']
            },

            {
                id: 2,
                photo: ['mln-308', 'jpg', '2'],
                name: 'Встраиваемая сверху раковина mln-308',
                price: parseFloat((43.98 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['встраиваемая сверху']], ['Форма', ['овальная']], ['Ширина, мм', ['560']], ['Глубина, мм', ['480']], ['Высота, мм', ['205']], ['Цвет', ['белый']] ],
                additional: 'Элегантная врезная раковина прекрасно впишется в стиль любой ванной комнаты: от классики до лофта. Помимо привлекательного внешнего вида и удобной формы раковина не требует особых усилий в уходе, долго сохраняет насыщенный белый цвет и глянцевый блеск.',
                presence: 'под заказ',
                link: 'mln-308',
                preLink: 'rakoviny_vstraivaemye_sverhu',
                same: ['mln-307']
            },

            {
                id: 3,
                photo: ['mln-320323', 'jpg', '2'],
                name: 'Встраиваемая сверху раковина mln-320323',
                price: parseFloat((59.92 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['встраиваемая сверху']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['500']], ['Глубина, мм', ['440']], ['Высота, мм', ['250']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320323',
                preLink: 'rakoviny_vstraivaemye_sverhu',
                same: ['']
            },

            {
                id: 4,
                photo: ['mln-509', 'jpg', '6'],
                name: 'Встраиваемая сверху раковина mln-509',
                price: parseFloat((83.9 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['нет']], ['Тип', ['встраиваемая сверху']], ['Форма', ['овальная']], ['Ширина, мм', ['560']], ['Глубина, мм', ['420']], ['Высота, мм', ['170']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-509',
                preLink: 'rakoviny_vstraivaemye_sverhu',
                same: ['']
            },

            {
                id: 5,
                photo: ['mln-9048B', 'jpg', '7'],
                name: 'Встраиваемая сверху раковина mln-9048B',
                price: parseFloat((57.08 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['встраиваемая сверху']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['415']], ['Глубина, мм', ['420']], ['Высота, мм', ['170']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-9048B',
                preLink: 'rakoviny_vstraivaemye_sverhu',
                same: ['']
            },
        ]
    },

    {
        name: 'Раковины| встраиваемые снизу',
        photo: 'rakoviny_vstraivaemye_snizu.png',
        link: 'rakoviny_vstraivaemye_snizu',
        cards: [
            {
                id: 1,
                photo: ['mln-540', 'jpg', '2'],
                name: 'Встраиваемая снизу раковина mln-540',
                price: parseFloat((43.98 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['встраиваемая снизу']], ['Форма', ['овальная']], ['Ширина, мм', ['560']], ['Глубина, мм', ['440']], ['Высота, мм', ['200']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-540',
                preLink: 'rakoviny_vstraivaemye_snizu',
                same: ['']
            },

            {
                id: 2,
                photo: ['mln-540n', 'jpg', '2'],
                name: 'Встраиваемая снизу раковина mln-540n',
                price: parseFloat((48.24 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['нет']], ['Тип', ['встраиваемая снизу']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['480']], ['Глубина, мм', ['360']], ['Высота, мм', ['195']], ['Цвет', ['белый']] ],
                additional: 'Врезная раковина, устанавливаемая под столешницу, придает современный вид всей ванной комнате. Отсутствие внешних стыков позволяет легко осуществлять уход "одним движением" и экономить полезную площадь на поверхности столешницы.',
                presence: 'под заказ',
                link: 'mln-540n',
                preLink: 'rakoviny_vstraivaemye_snizu',
                same: ['']
            },
        ]
    },

    {
        name: 'Раковины| накладные (белые)',
        photo: 'rakoviny_nakladnye_belye.jpg',
        link: 'rakoviny_nakladnye_belye',
        cards: [
            {
                id: 1,
                photo: ['mln-320301', 'jpg', '3'],
                name: 'Накладная раковина mln-320301',
                price: parseFloat((71.06 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['550']], ['Глубина, мм', ['400']], ['Высота, мм', ['150']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320301',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 2,
                photo: ['mln-320306', 'jpg', '2'],
                name: 'Накладная раковина mln-320306',
                price: parseFloat((69.23 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['квадратная']], ['Ширина, мм', ['420']], ['Глубина, мм', ['420']], ['Высота, мм', ['155']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320306',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 3,
                photo: ['mln-320308', 'jpg', '3'],
                name: 'Накладная раковина mln-320308',
                price: parseFloat((64.46 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['415']], ['Глубина, мм', ['310']], ['Высота, мм', ['130']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320308',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 4,
                photo: ['mln-320309', 'jpg', '8'],
                name: 'Накладная раковина mln-320309',
                price: parseFloat((75.44 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['405']], ['Глубина, мм', ['510']], ['Высота, мм', ['145']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320309',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 5,
                photo: ['mln-320314', 'jpg', '2'],
                name: 'Накладная раковина mln-320314',
                price: parseFloat((103.86 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['600']], ['Глубина, мм', ['440']], ['Высота, мм', ['200']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320314',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 6,
                photo: ['mln-320315', 'jpg', '5'],
                name: 'Накладная раковина mln-320315',
                price: parseFloat((57.08 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['600']], ['Глубина, мм', ['400']], ['Высота, мм', ['200']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320315',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 7,
                photo: ['mln-320317', 'jpg', '8'],
                name: 'Накладная раковина mln-320317',
                price: parseFloat((57.34 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['490']], ['Глубина, мм', ['350']], ['Высота, мм', ['140']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320317',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 8,
                photo: ['mln-320318', 'jpg', '2'],
                name: 'Накладная раковина mln-320318',
                price: parseFloat((56.81 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['510']], ['Глубина, мм', ['370']], ['Высота, мм', ['130']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320318',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 9,
                photo: ['mln-a457', 'jpg', '4'],
                name: 'Накладная раковина mln-a457',
                price: parseFloat((78.03 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['625']], ['Глубина, мм', ['420']], ['Высота, мм', ['140']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-a457',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 10,
                photo: ['mln-320339', 'jpg', '2'],
                name: 'Накладная раковина mln-320339',
                price: parseFloat((66.79 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина, мм', ['360']], ['Глубина, мм', ['360']], ['Высота, мм', ['120']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320339',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 11,
                photo: ['mln-320352', 'jpg', '3'],
                name: 'Накладная раковина mln-320352',
                price: parseFloat((59.64 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['505']], ['Глубина, мм', ['385']], ['Высота, мм', ['135']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-320352',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 12,
                photo: ['mln-5006', 'jpg', '4'],
                name: 'Накладная раковина mln-5006',
                price: parseFloat((53.94 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['овальная']], ['Ширина, мм', ['590']], ['Глубина, мм', ['405']], ['Высота, мм', ['145']], ['Цвет', ['белый']] ],
                additional: 'Овальная накладная раковина легко монтируется на столешницу. Широкая чаша не позволяет брызгам воды разлетаться, облегчая уход за прилегающими поверхностями. Модель будет прекрасно смотреться в ванной комнате с современным дизайном.',
                presence: 'под заказ',
                link: 'mln-5006',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 13,
                photo: ['mln-7005a', 'jpg', '4'],
                name: 'Накладная раковина mln-7005a',
                price: parseFloat((71.06 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['570']], ['Глубина, мм', ['455']], ['Высота, мм', ['155']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-7005a',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 14,
                photo: ['mln-7033', 'jpg', '5'],
                name: 'Накладная раковина mln-7033',
                price: parseFloat((76.74 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['520']], ['Глубина, мм', ['410']], ['Высота, мм', ['140']], ['Цвет', ['белый']] ],
                additional: 'Четкие ровные линии раковины придутся по душе любителям минимализма и прагматичности. Модель имеет платформу, которая служит не только основанием для установки смесителя, но и дополнительным местом для гигиенических принадлежностей. Наличие перелива делает использование раковины более безопасным. Раковина легко устанавливается и не требует особых усилий в уходе.',
                presence: 'под заказ',
                link: 'mln-7033',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 15,
                photo: ['mln-7050h', 'jpg', '5'],
                name: 'Накладная раковина mln-7050h',
                price: parseFloat((53.97 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['485']], ['Глубина, мм', ['380']], ['Высота, мм', ['135']], ['Цвет', ['белый']] ],
                additional: 'Широкая раковина с закругленными бортами обеспечивает ее комфортное использование и легкий уход. Лаконичный дизайн и идеальный белый цвет с глянцевым блеском добавляют раковине изысканности. Данная модель способна стать центральным элементом и украсить интерьер ванной комнаты в современном дизайне.',
                presence: 'под заказ',
                link: 'mln-7050h',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 16,
                photo: ['mln-7063b', 'jpg', '5'],
                name: 'Накладная раковина mln-7063b',
                price: parseFloat((58.64 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['405']], ['Глубина, мм', ['405']], ['Высота, мм', ['150']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-7063b',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 17,
                photo: ['mln-7078d', 'jpg', '4'],
                name: 'Накладная раковина mln-7078d',
                price: parseFloat((51.1 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина, мм', ['355']], ['Глубина, мм', ['355']], ['Высота, мм', ['125']], ['Цвет', ['белый']] ],
                additional: 'Первая мысль покупателя при взгляде на эту модель — абсолютная надежность и долговечность. Ее устойчивый корпус и крепкая форма понравятся тем, кто предпочитает стабильность и старую добрую классику. Благодаря идеально гладкому глазурованному покрытию вы можете быть спокойны за чистоту вашей раковины — загрязнению и бактериям здесь не место. Высококачественный санфаянс исключает негативное воздействие бытовой химии — чистить раковину легко и приятно. Среди накладных раковин 35 см нет равных по удобству и надежности этой модели.',
                presence: 'под заказ',
                link: 'mln-7078d',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 18,
                photo: ['mln-7235', 'jpg', '5'],
                name: 'Накладная раковина mln-7235',
                price: parseFloat((75.35 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['650']], ['Глубина, мм', ['390']], ['Высота, мм', ['140']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-7235',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 19,
                photo: ['mln-7291', 'jpg', '7'],
                name: 'Накладная раковина mln-7291',
                price: parseFloat((50.88 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['490']], ['Глубина, мм', ['380']], ['Высота, мм', ['135']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-7291',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },

            {
                id: 20,
                photo: ['mln-7295', 'jpg', '2'],
                name: 'Накладная раковина mln-7295',
                price: parseFloat((79.61 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['есть']], ['Отверстие под смеситель', ['есть']], ['Тип', ['накладная']], ['Форма', ['прямоугольная']], ['Ширина, мм', ['590']], ['Глубина, мм', ['450']], ['Высота, мм', ['150']], ['Цвет', ['белый']] ],
                additional: '',
                presence: 'под заказ',
                link: 'mln-7295',
                preLink: 'rakoviny_nakladnye_belye',
                same: ['']
            },
        ]
    },

    {
        name: 'Раковины| накладные (цветные)',
        photo: 'rakoviny_nakladnye_cvetnye.png',
        link: 'rakoviny_nakladnye_cvetnye',
        cards: [
            {
                id: 1,
                photo: ['mln-t4022-g28', 'jpg', '2'],
                name: 'Накладная раковина mln-t4022-g28 (золото)',
                price: 456.59,
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Поверхность', ['декоративная']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина', ['390 мм']], ['Глубина', ['390 мм']], ['Высота', ['140 мм']], ['Цвет', ['золото']] ],
                additional: 'Обжиг при температуре 1200-1300 C&#176.',
                presence: 'на складе',
                link: 'mln-t4022-g28',
                preLink: 'rakoviny_nakladnye_cvetnye',
                same: ['']
            },
        ]
    },

    {
        name: 'Кухонные мойки| 1,2 мм',
        photo: 'kuhonnye_mojki_1,2_mm.jpg',
        link: 'kuhonnye_mojki_1,2_mm',
        cards: [
            {
                id: 1,
                photo: ['d400b', 'jpg', '3'],
                name: 'Кухонная мойка 1,2/200 графит d400b',
                price: parseFloat((265.68 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['да']], ['Отверстие под смеситель', ['нет']], ['Тип', ['врезная']], ['Форма', ['многоугольная']], ['Толщина стали', ['1,2 мм']], ['Расположение чаши', ['универсальная']], ['Ширина', ['400 мм']], ['Глубина', ['400 мм']], ['Высота', ['200 мм']], ['Цвет', ['графит']] ],
                additional: '',
                presence: 'под заказ',
                link: 'd400b',
                preLink: 'kuhonnye_mojki_1,2_mm',
                same: ['d400br', 'd400g']
            },

            {
                id: 2,
                photo: ['d400br', 'jpg', '3'],
                name: 'Кухонная мойка 1,2/200 бронза d400br',
                price: parseFloat((265.68 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['да']], ['Отверстие под смеситель', ['нет']], ['Тип', ['врезная']], ['Форма', ['многоугольная']], ['Толщина стали', ['1,2 мм']], ['Расположение чаши', ['универсальная']], ['Ширина', ['400 мм']], ['Глубина', ['400 мм']], ['Высота', ['200 мм']], ['Цвет', ['бронза']] ],
                additional: '',
                presence: 'под заказ',
                link: 'd400br',
                preLink: 'kuhonnye_mojki_1,2_mm',
                same: ['d400b', 'd400g']
            },

            {
                id: 3,
                photo: ['d400g', 'jpg', '3'],
                name: 'Кухонная мойка 1,2/200 золото d400g',
                price: parseFloat((265.68 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['да']], ['Отверстие под смеситель', ['нет']], ['Тип', ['врезная']], ['Форма', ['многоугольная']], ['Толщина стали', ['1,2 мм']], ['Расположение чаши', ['универсальная']], ['Ширина', ['400 мм']], ['Глубина', ['400 мм']], ['Высота', ['200 мм']], ['Цвет', ['золото']] ],
                additional: '',
                presence: 'под заказ',
                link: 'd400g',
                preLink: 'kuhonnye_mojki_1,2_mm',
                same: ['d400b', 'd400br']
            },
        ]
    },

    {
        name: 'Кухонные мойки| 3 мм',
        photo: 'kuhonnye_mojki_3_mm.jpg',
        link: 'kuhonnye_mojki_3_mm',
        cards: [
            {
                id: 1,
                photo: ['d5050hg', 'jpg', '4'],
                name: 'Кухонная мойка 3/200 золото d5050hg',
                price: parseFloat((236.68 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['да']], ['Отверстие под смеситель', ['да']], ['Тип', ['врезная']], ['Форма', ['квадратная']], ['Вид поверхности', ['PVD золото']], ['Монтаж', ['сверху на столешницу']], ['Комплектация', ['сифон']], ['Толщина стали борта', ['3 мм']], ['Толщина стали чаши', ['1,2 мм']], ['Диаметр слива, дюйм', ['3 1/2']], ['Ширина', ['500 мм']], ['Глубина', ['500 мм']], ['Высота', ['200 мм']], ['Цвет', ['золото']] ],
                additional: 'Квадратная кухонная мойка с небольшой платформой для смесителя и моющих средств компактно впишется в интерьер современной кухни. Глубокая вместительная чаша справится с большим объемом посуды. Толстая сталь, устойчивая к высоким температурам, легко выдержит горячие сковороды и кастрюли.<br>Особенностью мойки является ее золотое PVD-покрытие, созданное на основе нанотехнологий, которое делает ее более долговечной и устойчивой к появлению царапин. Также покрытие способствует скатыванию капель воды со стенок чаши. На поверхности не остается следов от них, поэтому не требуется лишних усилий для поддержания привлекательного вида мойки.<br>Мойка практична и гигиенична. Поддерживать ее чистоту проще благодаря скругленным внутренним углам и конструкции дна с небольшим уклоном, который не позволяет воде застаиваться в чаше.<br>Широкий диаметр слива препятствует возникновению засоров, а наличие отверстия для перелива делает использование мойки более безопасным.<br>Снижение шума от воды при эксплуатации мойки обеспечивают изоляционный слой и накладки на обратной стороны мойки. Благодаря им использование мойки становится тихим и комфортным.<br>Мойка комплектуется сифоном с выводом для подключения к канализации и набором для базового способа монтажа.<br>Базовым способом монтажа для мойки является установка сверху в вырезанное в столешнице отверстие. Однако данная модель подходит для установки под столешницу. В таком случае крепежи приобретаются отдельно.',
                presence: 'под заказ',
                link: 'd5050hg',
                preLink: 'kuhonnye_mojki_3_mm',
                same: ['']
            },
        ]
    },

    {
        name: 'Донные клапаны| без перелива',
        photo: 'donnye_klapany_bez_pereliva.jpg',
        link: 'donnye_klapany_bez_pereliva',
        cards: [
            {
                id: 1,
                photo: ['mln-tb20-1', 'jpg', '2'],
                name: 'Донный клапан без перелива (белый) mln-tb20-1',
                price: parseFloat((25.31 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Ширина', ['70 мм']], ['Глубина', ['70 мм']], ['Высота', ['110 мм']], ['Цвет', ['белый']] ],
                additional: 'Белый донный клапан - стильное решение для оформления слива у раковины. Он идеально подходит для белых раковин, но также прекрасно может дополнить умывальники из коллекции цветного фаянса Melana.<br>Донный клапан изготовлен из долговечной латуни. Керамический диск покрыт белой глазурью. Он оснащен механизмом click-clack, который позволяет перекрыть слив и набрать воду в раковине.<br>Донный клапан без перелива подходит для раковин, не имеющих отверстия для перелива.',
                presence: 'под заказ',
                link: 'mln-tb20-1',
                preLink: 'donnye_klapany_bez_pereliva',
                same: ['']
            },

            {
                id: 2,
                photo: ['mln-330303br', 'jpg', '3'],
                name: 'Донный клапан без перелива (бронза) mln-330303br в блистере',
                price: parseFloat((25.65 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Ширина', ['65 мм']], ['Глубина', ['65 мм']], ['Высота', ['90-110 мм']], ['Цвет', ['бронза']] ],
                additional: 'Донный клапан выполнен из долговечной латуни. Механизм клик-клак позволяет перекрыть слив и набрать воду в раковине.',
                presence: 'под заказ',
                link: 'mln-330303br',
                preLink: 'donnye_klapany_bez_pereliva',
                same: ['']
            },

            {
                id: 3,
                photo: ['mln-330304g', 'jpg', '3'],
                name: 'Донный клапан без перелива (золото) mln-330304g в блистере',
                price: parseFloat((25.65 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Ширина', ['65 мм']], ['Глубина', ['65 мм']], ['Высота', ['90-110 мм']], ['Цвет', ['золото']] ],
                additional: 'Донный клапан выполнен из долговечной латуни. Механизм клик-клак позволяет перекрыть слив и набрать воду в раковине.',
                presence: 'под заказ',
                link: 'mln-330304g',
                preLink: 'donnye_klapany_bez_pereliva',
                same: ['']
            },

            {
                id: 4,
                photo: ['mln-tb52-1', 'jpg', '3'],
                name: 'Донный клапан без перелива (хром) mln-tb52-1',
                price: parseFloat((25.31 * exchangeRates).toFixed(2)),
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Ширина', ['70 мм']], ['Глубина', ['85 мм']], ['Высота', ['107 мм']], ['Цвет', ['серебро']] ],
                additional: 'Донный клапан хром - стильное и современное решение для оформления слива у раковины. Он подходит для умывальников практически любого цвета. Прекрасно гармонирует со смесителями и аксессуарами серебристого оттенка.<br>Донный клапан изготовлен из долговечной латуни. Керамический диск покрыт серебристой глазурью. Он оснащен механизмом click-clack, который позволяет перекрыть слив и набрать воду в раковине.',
                presence: 'под заказ',
                link: 'mln-tb52-1',
                preLink: 'donnye_klapany_bez_pereliva',
                same: ['']
            },
        ]
    },
]

export default goods;