import { Category } from '../../../src/interfaces/index';

const goods: Category[] = [
    {
        name: 'Раковины',
        photo: 'rakoviny.png',
        link: 'rakoviny',
        cards: [
            {
                id: 1,
                photo: [
                    'mln-107sm/1.jpg'
                ],
                name: 'Накладная раковина mln-107sm (бронза)',
                price: 286.20,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['декоративная']],
                    ['Тип', ['накладная']],
                    ['Форма', ['круглая']],
                    ['Ширина', ['360']],
                    ['Глубина', ['360']],
                    ['Высота', ['155']],
                    ['Цвет', ['бронза']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'на складе',
                vendorCode: 'MLN-107SM',
                link: 'mln-107sm',
            },

            {
                id: 2,
                photo: [
                    'mln-t4022-g28/1.jpg'
                ],
                name: 'Накладная раковина mln-t4022-g28 (золото)',
                price: 456.59,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['декоративная']],
                    ['Тип', ['накладная']],
                    ['Форма', ['круглая']],
                    ['Ширина', ['390']],
                    ['Глубина', ['390']],
                    ['Высота', ['140']],
                    ['Цвет', ['золото']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'на складе',
                vendorCode: 'MLN-T4022-G28',
                link: 'mln-t4022-g28',
            },

            {
                id: 3,
                photo: [
                    'mln-7020sj/1.jpg'
                ],
                name: 'Накладная раковина mln-7020sj (золото)',
                price: 387.72,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['декоративная']],
                    ['Тип', ['накладная']],
                    ['Форма', ['круглая']],
                    ['Ширина', ['425']],
                    ['Глубина', ['425']],
                    ['Высота', ['150']],
                    ['Цвет', ['золото']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'на складе',
                vendorCode: 'MLN-7020SJ',
                link: 'mln-7020sj',
            },

            {
                id: 4,
                photo: [
                    'mln-7020ss/1.jpg'
                ],
                name: 'Накладная раковина mln-7020ss (серебро)',
                price: 382.32,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['декоративная']],
                    ['Тип', ['накладная']],
                    ['Форма', ['круглая']],
                    ['Ширина', ['425']],
                    ['Глубина', ['425']],
                    ['Высота', ['150']],
                    ['Цвет', ['серебро']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'под заказ',
                vendorCode: 'MLN-7020SS',
                link: 'mln-7020ss',
            },

            {
                id: 5,
                photo: [
                    'mln-a419-cv13/1.jpg'
                ],
                name: 'Накладная раковина mln-a419-cv13 (мрамор)',
                price: 426.49,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['камень']],
                    ['Тип', ['накладная']],
                    ['Форма', ['прямоугольная']],
                    ['Ширина', ['485']],
                    ['Глубина', ['395']],
                    ['Высота', ['145']],
                    ['Цвет', ['мрамор']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'под заказ',
                vendorCode: 'MLN-A419-CV13',
                link: 'mln-a419-cv13',
            },

            {
                id: 6,
                photo: [
                    'mln-a420-cv11/1.jpg'
                ],
                name: 'Накладная раковина mln-a420-cv11 (мрамор)',
                price: 426.49,
                characteristics: [
                    ['Отверстие под перелив', ['нет']],
                    ['Отверстие под смеситель', ['нет']],
                    ['Поверхность', ['камень']],
                    ['Тип', ['накладная']],
                    ['Форма', ['квадратная']],
                    ['Ширина', ['410']],
                    ['Глубина', ['410']],
                    ['Высота', ['145']],
                    ['Цвет', ['мрамор']],
                ],
                additional: [
                    'Обжиг при температуре 1200-1300 С'
                ],
                presence: 'под заказ',
                vendorCode: 'MLN-A420-CV11',
                link: 'mln-a420-cv11',
            },
        ]
    },
]

export default goods;