import { Category } from '../../../src/interfaces/index';

const goods: Category[] = [
    {
        name: 'Раковины накладные',
        photo: 'rakoviny_nakladnye.png',
        link: 'rakoviny_nakladnye',
        cards: [
            {
                id: 1,
                photo: ['mln-107sm', 'jpg', '4'],
                name: 'Накладная раковина mln-107sm (бронза)',
                price: 286.20,
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Поверхность', ['декоративная']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина', ['360 мм']], ['Глубина', ['360 мм']], ['Высота', ['155 мм']], ['Цвет', ['бронза']] ],
                additional: 'Обжиг при температуре 1200-1300 С',
                presence: 'под заказ',
                link: 'mln-107sm',
                preLink: 'rakoviny_nakladnye',
                same: ['mln-t4022-g28']
            },

            {
                id: 2,
                photo: ['mln-t4022-g28', 'jpg', '2'],
                name: 'Накладная раковина mln-t4022-g28 (золото)',
                price: 456.59,
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Поверхность', ['декоративная']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина', ['390 мм']], ['Глубина', ['390 мм']], ['Высота', ['140 мм']], ['Цвет', ['золото']] ],
                additional: 'Обжиг при температуре 1200-1300 С',
                presence: 'на складе',
                link: 'mln-t4022-g28',
                preLink: 'rakoviny_nakladnye',
                same: ['']
            },

            {
                id: 3,
                photo: ['mln-7020sj', 'jpg', '4'],
                name: 'Накладная раковина mln-7020sj (золото)',
                price: 387.72,
                characteristics: [ ['Отверстие под перелив', ['нет']], ['Отверстие под смеситель', ['нет']], ['Поверхность', ['декоративная']], ['Тип', ['накладная']], ['Форма', ['круглая']], ['Ширина', ['425']], ['Глубина', ['425']], ['Высота', ['150']], ['Цвет', ['золото']] ],
                additional: 'Обжиг при температуре 1200-1300 С',
                presence: 'на складе',
                link: 'mln-7020sj',
                preLink: 'rakoviny_nakladnye',
                same: ['']
            },
        ]
    },
]

export default goods;